## Data Wrangling: Clean, Transform, Merge, Reshape 
##### - Much of the programming work in data analysis and modeling is spent in data preparation.
##### - That is, data loading, cleaning, transforming, and rearranging.
##### - This is discussed and demonstrated below.

In [2]:
# Importing the necessary libraries 

import pandas as pd 
import numpy as np

### Performing DataFrame Merges

In [ ]:
# Creating Pandas DataFrames 

df1 = pd.DataFrame(
    np.arange(12).reshape(4,3),
    index=list("abcd")
)

df2 = pd.DataFrame(
    np.arange(9).reshape(3,3),
    index=list("abc")
)

In [ ]:
# In the below operating, the merging will take place on the overallaping column names 
# as the keys.
# It is, however, good practice to specify the column names where merging will take place

pd.merge(df1, df2)

In [ ]:
data_1 = pd.DataFrame(
    {
        'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
        "data": range(7)
    }
)

data_2 = pd.DataFrame(
    {
        'key': ['a', 'b', 'd'],
        "data": range(3)
    }
)

data_2

In [ ]:
data_1

In [ ]:
pd.merge(data_1, data_2, on="key")

In [ ]:
# Creating a Population DataFrame 

df1 = pd.DataFrame({
    "Country": ["America", "Indonesia", "France"],
    "Location": ["New York", "Jakarta", "Paris"],
    "Population": [738100, 575030, 183305]
})

df2 = pd.DataFrame({
    "Country": ["America", "America", "Indonesia", "India", "France", "Greece"],
    "Location": ["New York", "Chicago", "Jakarta", "Mumbai", "Paris", "Yunani"],
    "Income": [1000, 1500, 1400, 1100, 900, 1200]
})

df1

In [ ]:
df2

In [ ]:
# Specifying the merge column as the key

pd.merge(df1, df2, on="Country")

##### - In a case where the merge columns are different in each DataFrame, 
#####   you can specify them as parameters separately

In [ ]:
# Specifying the merge columns seperately as paramters 

pd.merge(df1, df2, left_on="Country", right_on="Country")

##### By default, merge will performs an "inner" join. 
##### However, you can specify the type of join that you want to achieve as with databases "outer", "inner", "left", or "right" joins.
##### - Check out the examples below

In [ ]:
# Performing a left join

pd.merge(df1, df2, right_on="Country", left_on="Country", how="left")

In [ ]:
# Performing a right join 

results = pd.merge(df1, df2, right_on="Country", left_on="Country", how="right")
results

### Understanding apply(), applymap(), and map()
___________
### 1). apply()
##### This method is defined for both pandas Series and DataFrame.
##### It allows us to apply functions and alter values along a specific axis. The default axis is columns.

In [4]:
# Importing the titanic dataset 

dataset = pd.read_csv("titanic.csv")
dataset.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
# Applying a function that categorizes the passanges based on thier age.
# Then we create a new column for the same 

# Categorizes passengers according to thier age
def age_categorizer(age: int):
    if age < 18:
        return "Child"
    elif age >= 18 and age <= 35: 
        return "Youth"
    else:
        return "Senior Citizen"

# Creating a new col with age_category as a label
dataset["age_category"] = dataset.Age.apply(age_categorizer)
dataset.head(10)

### 2). map()
#### - This method is defined for Pandas Series objects. 
#### - It is used to substitute values in a Series object using a function, dictionary, or another Series object

In [ ]:
# Using map() to map gender values to numerical values 
# that is, 0 for male and 1 for female 

def gender_mapping(gender: str): # The function for mapping gender
    return 0 if gender == "male" else 1

dataset["gender_map"] = dataset.Sex.map(gender_mapping)
dataset.head(10)

In [ ]:
# We can also use a dictionary to map gender values to numerical values 

mapping_dict = {
    "male": 0,
    "female": 1
}

dataset.Sex.map(mapping_dict)

## Understanding Grouping and Sorting
##### - Grouping our data is very important as it allows us to perform some operations to these data

In [ ]:
dataset.head(5)

In [ ]:
# Grouping the data based on Sex and finding the mean

# The average age of a remale = 27.91 
# The average age of a male = 30.72

dataset.groupby("Sex").Age.mean()

In [ ]:
# Grouping the data based on age categorization, that is, Youth, Child, or Senior Citizen 
# Then getting the average age of each category 

# The average age of a Child is 9 yrs
# The average age of a Youth is 26 yrs 
# The average age of Senior Citizen is 46 yrs, haha.

dataset.groupby("age_category").Age.mean()

In [ ]:
# We can also county the number of passengers based on each category 
# For example, the number of males and females 

# There are 314 females 
# There are 577 males

dataset.groupby("Sex").Sex.value_counts()

In [ ]:
# Getting the number of passangers based on age categorization 

# There are 113 Children 
# There are 384 Youths 
# There are 394 Senior Citizens

data= dataset.groupby("age_category")
data.Sex.value_counts()
data.Sex.count()

#### To obtain a more fine-grained groups, you can use groupby() with more than one column
#### See examples below

In [ ]:
dataset.head()

In [ ]:
# We want to know the number of people who bought the tickets, their class, and whether they survived.

data = dataset.groupby(["age_category", "Pclass"])
data["Survived"].value_counts()

In [ ]:
# Get the number of people who bought the tickets, thier gender and whwether they survived.

data = dataset.groupby(["Sex", "Pclass"])
data["Survived"].value_counts()

### Using another dataset to understand groupby() better

In [3]:
# Creating a simple DataFrame 

tech_langs   = ({
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas","Hadoop","Spark","Python"],
    'Fee' :[22000,25000,23000,24000,26000,25000,25000,22000],
    'Duration':['30days','50days','55days','40days','60days','35days','55days','50days'],
    'Discount':[1000,2300,1000,1200,2500,1300,1400,1600]
})

data = pd.DataFrame(tech_langs, columns=['Courses','Fee','Duration','Discount'])
data

   Courses    Fee Duration  Discount
0    Spark  22000   30days      1000
1  PySpark  25000   50days      2300
2   Hadoop  23000   55days      1000
3   Python  24000   40days      1200
4   Pandas  26000   60days      2500
5   Hadoop  25000   35days      1300
6    Spark  25000   55days      1400
7   Python  22000   50days      1600

##### - Group the data based on the Courses column and then use sum() to get the sum for all numerical columns in the DataFrame 
##### - The group key is used as the index of the resulting DataFrame by default. 
##### - To turn this off, you can use "as_index=False" param

In [ ]:
# grouping the data and getting the sum of all numerical columns in the DataFrame
data.groupby("Courses").sum()

In [ ]:
# Turning off the default index 
data.groupby("Courses", as_index=False).sum()

#### * Rather than performing a sum on all numerical values in the DataFrame, we can explicitly specify the column to which we want to perform the sum

In [ ]:
# Specifying the column to perform the sum on 
# In this case, we get the total fees for each course

data.groupby("Courses")["Fee"].sum()

#### * We can also group the data using more than one column. We just need to send a list of columns.
#### * Then we can calculate the sum.

In [ ]:
# Using multiple columns to group the data 

data.groupby(["Courses", "Duration"])["Fee"].sum()

#### * We can still use the groupby() to get sum() and count() at the same time

In [4]:
# Applying more than one function to the groupby()

data.groupby("Courses")["Fee"].agg(["sum", "count"])

           sum  count
Courses
Hadoop   48000      2
Pandas   26000      1
PySpark  25000      1
Python   46000      2
Spark    47000      2

In [5]:
data.groupby("Courses").agg({"Fee": ["sum", "count"]})

           Fee
           sum count
Courses
Hadoop   48000     2
Pandas   26000     1
PySpark  25000     1
Python   46000     2
Spark    47000     2

## Sorting 
#### * By default, pandas will sort the results in ascending order based on the groupby() keys. 
#### * This can however be turned off as illustrated below

In [7]:
data.head(5)

   Courses    Fee Duration  Discount
0    Spark  22000   30days      1000
1  PySpark  25000   50days      2300
2   Hadoop  23000   55days      1000
3   Python  24000   40days      1200
4   Pandas  26000   60days      2500

In [15]:
# Turning off default sorting 

unsorted_df = data.groupby("Courses", sort=False).sum()
unsorted_df

           Fee      Duration  Discount
Courses
Spark    47000  30days55days      2400
PySpark  25000        50days      2300
Hadoop   48000  55days35days      2300
Python   46000  40days50days      2800
Pandas   26000        60days      2500

####

In [16]:
# The result can then be sorted later on need bases 

sorted_df = unsorted_df.sort_values("Courses")
sorted_df

           Fee      Duration  Discount
Courses
Hadoop   48000  55days35days      2300
Pandas   26000        60days      2500
PySpark  25000        50days      2300
Python   46000  40days50days      2800
Spark    47000  30days55days      2400

### Working with Missing Data 
#### - Missing datapoints are represented with a NaN ('Not a Number') whose dtype is "float64"
#### - Pandas provides specific methods for working with NaN.
#### - They are; 
##### 1. isnull() 
##### 2. notnull()

In [5]:
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
# Selecting the NaN records based on "Cabin" col

dataset[pd.isnull(dataset.Cabin)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [7]:
# Selecting the NaN records based on "Age" col 

dataset[pd.isnull(dataset.Age)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

** All the above records have missing values on the Age col

## Replacing the missing values 
##### -- A common operation in data cleaning is to know how to deal with the NaN or mission values.
##### -- Pandas provides methods for replacing NaN with something else thru' fillna()